<template>
  <q-page class="flex-center">
    <q-splitter v-model="splitterModel" horizontal>
      <template v-slot:before>
        <div class="row">
          <q-tabs
            v-model="tab"
            class="tabColor"
            inline-label
            outside-arrows
            mobile-arrows>
            <q-tab :name="'userAgreement'" label="服务协议" />
            <q-tab :name="'privacyPolicy'" label="隐私政策" />
          </q-tabs>
        </div>
      </template>
      <template v-slot:after>
        <q-tab-panels
          v-model="tab"
          animated
          vertical
          transition-prev="jump-up"
          transition-next="jump-down">
          <q-tab-panel class="inside-cont-term-privacy" name="userAgreement">
            <div class="text-h4 q-mb-md">
              货币汇率平台服务协议
              <span v-show="$q.screen.width > 700" class="text-h6">
                更新日期：【2022】年【08】月【03】日
              </span>
            </div>
            <span v-show="$q.screen.width <= 700" class="text-h6">
              更新日期：【2022】年【08】月【03】日
            </span>
            <p>
              欢迎您（以下简称“用户”或“您”）访问由【Matrix Networking
              PTE.LTD.】运营管理，并享有全部知识产权的货币汇率平台（包括但不限于网址为【少网址】的网站、名称为“货币汇率”的移动客户端APP以及公司后续不时开发或运营的其他平台，以下简称“本平台”或“我们”）以使用我们提供的产品及服务。
            </p>
            <div class="text-h4 q-mb-md">一、协议生效及构成</div>
            <p>
              您在首次使用本平台服务前，应当认真阅读《货币汇率平台服务协议》（以下简称“本协议”）。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制本平台责任的条款、法律适用和争议解决条款。免除或者限制责任的条款将以粗体下划线标识，您应重点阅读。如您对协议有任何疑问，可发送邮件至 matrixnetworking2022@gmail.com咨询。
            </p>
            <p>
              当您选择并使用本平台服务即表示您已充分阅读、理解并接受本协议的全部内容，并与本平台达成一致，成为本平台用户。本协议对您及平台均具有法律约束力。本平台有权在必要时自主决定修订本协议，修订后的协议从本平台处发布时即生效，并以平台公告、APP弹窗、站内信、电子邮件等一种或多种方式通知您。您可以随时在本平台查阅修订后的最新版本协议。如您不同意修订后的本协议，您有权停止使用本平台服务。本协议更新后，如果您继续使用本平台服务，即视为您已同意修改后的协议并受其约束。
            </p>
            <p>
              您使用本平台服务时，除遵守本协议外，还应遵守本平台发布的各项用户行为规则、使用说明，上述内容构成本协议的组成部分。您确认并同意，当您使用本平台某一具体服务时，该等服务可能由本平台的第三方合作方提供，且具体的第三方服务提供方可能会与您签署单独的服务协议，因此您使用具体服务时，还应遵守该服务协议。如您违反用户行为规则或与服务提供方签署的服务协议，亦构成违反本协议约定的违约行为。
            </p>
            <div class="text-h4 q-mb-md">二、账户注册及注意事项</div>
            <p>
              请您注意，只有具备完全民事权利能力和民事行为能力的主体可以注册本平台账户并成为本平台注册用户，在您开始注册程序前，您确认您具备完全民事权利能力和民事行为能力。如果您不具备前述主体资格而进行注册，您及您的法定监护人应承担由此导致的一切后果，且本平台有权注销您的账户并保留追究您相应责任的权利。
            </p>
            <p>
              您应按照本平台的注册/登陆页面提示填写相关信息，阅读并同意本协议且完成创建账户程序后即可创建本平台账户。您必须成为注册用户并通过本平台的身份验证后才能正常使用本平台或本平台合作的第三方机构提供的部分特定服务，基于风险控制需要，本平台可自行决定是否向您提供用户标识。
            </p>
            <p>
              在注册过程中，您应按本平台的要求提供真实、准确、合法、有效的个人信息；注册完成后若您的个人信息发生变化，您应当及时更新相关信息。若您提供的个人信息不真实、不准确、不合法或未及时在本平台更新，您需承担由此引起的相应责任和后果，并且本平台保留终止您使用本平台各项服务的权利。
            </p>
            <p>
              注册完成后，本平台向您提供唯一编号的货币汇率账户，账户凭证是本平台识别您身份的依据。您的账户由您自行设置并保管，您应当维护您账户的安全，自行对账户的账号、登陆密码（如有）、支付密码（如有）、验证码等账户凭证的安全性负责，不得将账户提供给任何第三方或交由任何第三方使用。账户因您主动泄漏或非因本平台原因泄漏、或因您遭受他人攻击、诈骗等行为导致的损失及后果，我们不承担任何责任，您应通过司法、行政等救济途径向侵权行为人追偿。通过您的账户发出的一切指令均视为您本人所为，您应对您账户下所有的行为结果负责，并自行承担相应的风险、责任和后果。
            </p>
            <p>
              如您发现或有任何理由怀疑您的账户凭证丢失、被盗用或被非法使用，建议您立即通知本平台。您理解我们对您的任何请求采取对应措施需要合理时间，且我们响应您的请求而采取的行动可能无法阻止或避免侵害后果的形成或扩大，除我们存在法定过错外，我们对此不承担任何责任。
            </p>
            <p>
              您不得通过任何手段恶意注册本平台账户，包括但不限于以牟利、炒作或其他非法目的等注册超过1个账户；您不得出借、转让您的账户或将您的账户赠与他人，也不得盗用其他账户，否则本平台有权追究您的相关责任。
            </p>
            <div class="text-h4 q-mb-md">三、平台服务及使用须知</div>
            <p class="text-h5 q-mb-md">平台服务与第三方服务内容</p>
            <p>
              (1) 您可以通过本平台使用由【Matrix Networking
              PTE.LTD.】提供的汇率信息服务，主要包括汇率行情查询服务、汇率换算服务、商用数据服务及其他信息技术服务（包括但不限于通过本平台与任何第三方进行信息沟通、跨境汇款交易等）。您理解并同意，我们所提供的汇率信息服务，其数据来源均来源于网络或第三方合作方，我们仅为上述服务提供信息技术支持，不对任何数据完整性、真实性、准确性或可靠性进行任何保证，任何使用或依赖通过本平台获得的任何内容或材料的风险由您自行承担。您理解并同意，上述服务的服务支持来源于第三方合作机构，我们作为信息平台仅提供信息技术支持，不属于具体服务提供方，不对您与第三方进行交易的成功性进行任何保证。
            </p>
            <p>
              (2)
              您在完成用户注册、取得用户标识后，可以通过本平台使用所显示的其他第三方服务。您理解并同意，上述服务的服务支持来源于第三方合作机构，我们作为信息平台仅提供信息技术支持，不属于具体服务提供方，不对您与第三方进行交易的成功性进行任何保证。 您在使用前述服务时，服务提供方可能会与您另行签署服务协议，该服务协议将告知您该项服务的具体内容、服务提供方信息以及您与服务提供方的权利义务，请您在使用该项具体服务前，认真阅读、充分理解相应的服务协议。请您注意，如果您使用第三方合作机构提供的跨境汇款业务，第三方合作机构出于业务合规之需要，还可能会为您开立专属同名虚拟银行账户。
            </p>
            <p class="text-h5 q-mb-md">服务使用须知</p>
            <p>
              (1)
              您理解并同意，在使用本平台的过程中，您所作出的行为（包括但不限于在线签署各类协议、发布信息、确认汇款等），完全出于自愿和独立决策，并自行承担相应的责任和后果。
            </p>
            <p>
              (2)
              您理解并同意，在使用本平台的过程中，您可能需要上传交易凭证（例如转账凭证），您应当确保凭证真实有效，如果您上传虚假凭证，您应自行承担相应责任，且您的交易对方及本平台有权追究您的相应责任。
            </p>
            <p>
              (3) 您理解并同意，您一旦确认使用本平台或第三方提供的服务，即代表您自愿接受发布在本平台支付页面的汇率牌价，并同意选择该外汇牌价中相应外汇的汇率折算进行支付或收款，而不论该外汇牌价是否是最新或对您最有利
            </p>
            <p>
              (4) 您理解并同意，由于兑换业务实行浮动汇率，实际交易汇率以合作方确认收到您所付款项时汇率为准，您最终收到的款项可能多于或少于您下单时金额。
            </p>
            <p>
              (5)
              您确认，您在交易过程中所使用或提供的货币来源合法，否则您将自行承担由此导致的全部责任和后果，本平台对此不承担任何责任。
            </p>
            <div class="text-h4 q-mb-md">四、服务费用</div>
            <p>
              您在使用本平台部分特定服务时，我们有权向您收取一定的服务费。我们有权决定服务费的收费方式和资费标准，并有权根据需要对资费政策随时进行调整。服务费的收取标准、支付方式等以本平台届时页面展示的为准。
            </p>
            <p>
              我们在收费时，会对收费项目作出明确的表示，并将具体的收费方式、资费标准通过服务界面进行展示，您在确认接受服务前应仔细阅读。如您拒绝该收费，将无法使用该项收费服务，如您继续使用该项服务，则视为您接受相关收费规则，您应当遵照收费规则向我们支付相应的费用。
            </p>
            <div class="text-h4 q-mb-md">五、平台责任限制</div>
            <p>
              您理解并同意，我们作为信息平台仅为平台运营提供信息技术支持服务，不经营任何交易项目。平台上发布的信息（包括但不限于汇率信息）均来自网络或第三方合作机构，上述信息可能存在风险或瑕疵，且部分服务（包括但不限于跨境汇款、留学缴费等）将由第三方合作机构直接向您提供，我们将依法采取相关检查监控措施尽可能保障您在平台上的合法权益及良好体验，但鉴于信息网络环境下信息与实物相分离的特点，本平台无法逐一审查服务信息的真实性、完整性，无法逐一审查交易所涉及服务的质量、安全以及合法性，您了解并愿意自行承担因使用我们的服务可能产生的风险。
            </p>
            <p>
              您理解并同意，在使用本平台服务的过中，可能会遇到不可抗力、技术风险等因素使本平台服务发生中断，对于下述原因导致的合同履行障碍、履行瑕疵、履行延迟或履行内容变更、数据丢失等情形，本平台不承担相应的违约责任：
            </p>
            <p>
              (1) 因自然灾害、流行病、罢工、暴乱、战争、政府行为、司法行政命令等不可抗力因素；
            </p>
            <p>
              (2) 您或本平台的电脑软件、系统、硬件出现故障或其他原因导致您无法使用本平台；
            </p>
            <p>
              (3) 因电力供应故障、通讯网络故障（包括但不限于电子通讯传达失败或延时、用于电子通讯的计算机程序对电子通讯的拦截或操纵）等公共服务因素或您自身因素（包括但不限于您操作不当、错误下单、通过非本平台授权的方式使用本平台服务）或第三人因素（包括但不限于受到计算机病毒、木马或其他恶意程序、黑客攻击的破坏等错误操作）；
            </p>
            <p>
              (4) 在本平台已尽善意管理的情况下，因常规或紧急的设备与系统维护、设备与系统故障、缺陷、网络与数据安全、技术风险等因素；
            </p>
            <p>(5) 其他本平台无法控制或无法合理预见的情形。</p>
            <p>
              您理解并同意，如果因平台系统故障或其他原因导致处理错误，无论有利于本平台还是有利于您，本平台都有权在根据本协议规定通知您后纠正该错误、回转/回档相关交易或数据。您理解并同意，您因前述处理错误而多付或少付的款项均不计利息，本平台不承担因前述处理错误而导致的任何损失或责任（包括您可能因前述错误导致的利息、汇率等损失）。
            </p>
            <p>
              平台仅对因平台原因给您造成的直接、实际损失依法承担相应的赔偿责任，不对任何间接损失、惩罚性赔偿承担责任。
            </p>
            <p>
              本平台有权自主决定经营策略。在平台发生合并、分立、收购、资产转让时，平台可向第三方转让本协议下相关资产。平台也可在单方通知您后，将本协议下部分或全部服务转交由第三方运营或履行，具体受让主体以平台通知的为准。
            </p>
            <div class="text-h4 q-mb-md">六、用户的承诺与保证</div>
            <p>
              在您使用本平台服务及第三方服务的过程中，您作出如下保证和承诺：
            </p>
            <p>
              不为任何非法目的或以任何非法方式使用本平台及第三方服务，并遵守所在地区的法律法规。如果本平台自行发现或第三方举报您存在非法情形的，本平台有权立即终止向您提供相关服务，并视需要可向监管部门报告。
            </p>
            <p>
              严格遵守本协议，用户行为准则、使用说明及与服务提供方另行签署的服务协议的约定与要求。
            </p>
            <p>
              不以任何方式干扰或试图干扰本平台的正常运作或以任何形式侵害本平台合法权益，包括但不限于使用任何装置、病毒、木马等干预本平台的正常运作，采取任何将导致不合理的庞大数据负载加诸本平台网络设备的行动等。
            </p>
            <p>
              不进行危害计算机网络安全的行为，该等行为包括但不限于：使用未经许可的数据或进入未经许可的服务器账号；未经允许进入公众计算机网络或者他人计算机系统并删除、修改、增加存储信息；未经许可，企图探查、扫描、测试本平台系统或网络的弱点或其它实施破坏网络安全的行为；企图干涉、破坏系统等的正常运行。
            </p>
            <p>
              尊重本平台合法权利，不实施侮辱、诽谤、侵犯本平台名誉权或其他侵犯本平台合法权利的行为。
            </p>
            <div class="text-h4 q-mb-md">七、广告及第三方链接</div>
            <p>
              您理解并同意，本平台在提供服务的过程中可能会自行或由第三方广告商向您发送广告、推广或宣传（包括商业与非商业信息），其方式和范围可不经向您特别通知而变更。如您不同意接受上述信息，可通过信息中给出的方式拒绝后续的该类信息。
            </p>
            <p>
              您理解并同意，对本平台服务中出现的广告信息，本平台将依照法律规定履行相关义务，但您仍需自行判断广告信息的真实性、可靠性并对此负责。除法律明确规定外，您因依该广告信息进行的交易或因前述广告内容而遭受的损失或损害，本平台不承担任何责任，您应当通过行政、司法等救济途径向责任人追偿。
            </p>
            <p>
              在您使用本平台期间，本平台可能会不时地提供由第三方拥有并控制的网站链接，以便您跟第三方沟通，向其购买产品或服务，参加其提供的促销活动。该等链接会带领您离开平台并且该等链接所指向的第三方网站内容不在平台控制范围之内，这些第三方网站各自订立了条款、条件和隐私政策，平台不会对这些网站的内容和活动负责。您应充分理解该等网站的内容及活动并自己承担浏览或访问这些网站的法律责任及风险。除本平台存在故意或重大过失外，本平台不对您由此产生的损失承担责任。
            </p>
            <div class="text-h4 q-mb-md">八、知识产权保护</div>
            <p>
              本平台所包含的全部智力成果，包括但不限于品牌商标、软件、数据、代码、设计、文字、图片、其他资料信息等，均归本平台所有。未经本平台书面授权，您不得为商业目的复制、修改、拷贝、使用或出售任何前述材料或内容。
            </p>
            <p>
              您在本平台发布或储存任何用户内容，包括但不限于图片、文章、评价、留言等，即视为您授予本平台可为商业目的、全球有效、非排他、免费、永久、不可撤销地对前述内容的使用权。
            </p>
            <div class="text-h4 q-mb-md">九、个人信息保护</div>
            <p>
              我们非常重视个人信息的保护，您使用本平台提供的服务时，您同意我们按照平台上公布的隐私政策收集、存储、使用、披露和保护您的个人信息，详情请参阅《货币汇率隐私政策》。
            </p>
            <div class="text-h4 q-mb-md">十、违约责任</div>
            <p>在您使用我们服务的过程中发生如下情形之一的，视为您违约：</p>
            <p>
              (1)
              使用本平台服务时违反有关法律法规规定的（包括但不限于中国境内的法律法规或您所在地区的法律法规）；
            </p>
            <p>
              (2)
              使用本平台服务时违反本协议、各项用户行为准则、使用说明的约定或规定的；
            </p>
            <p>
              (3)
              使用本平台上第三方服务提供商所提供服务时违反与其签署的相关服务协议的。
            </p>
            <p>如果您出现违约，我们有权对您采取以下处置措施：</p>
            <p>
              (1)
              本平台有权视行为严重程度采取警告、暂停服务、终止服务、注销账号等措施。
            </p>
            <p>
              (2)
              本平台可对您上述违约行为的处置措施信息以及其他经国家行政或司法机关生效法律文书确认的违法信息在平台上予以公示。
            </p>
            <p>
              如您出现违约行为，您应当自行承担相应的违约责任并赔偿相关方因此产生的费用和损失，包括但不限于直接损失、间接损失、实现债权费用、诉讼费、律师费等。如本平台因您的违约行为遭受损失或代为偿还的，您应予以赔偿。
            </p>
            <div class="text-h4 q-mb-md">十一、通知与送达</div>
            <p>
              您提供给本平台的联系方式（包括您的电子邮件地址、联系电话、联系地址等）应保持有效和联系畅通，如联系方式发生变更的，您有义务及时更新有关信息，并保持可被联系的状态，否则本平台存储的您最后一次提供的联系方式即视为您的有效联系方式；您的平台账号可正常接收本平台推送信息、系统消息的也视为有效联系方式；因您未及时更新联系方式而导致无法及时获取查看相关通知的，由您自行承担全部后果。
            </p>
            <p>
              本平台将通过您的上述有效联系方式的其中之一或其中若干向您送达各类通知，而此类通知的内容可能对您的权利义务产生重大的有利或不利影响，请您务必及时关注。
            </p>
            <p>
              通知如果是通过专人递送或商业快递服务发出的，则应于签收之日或拒收之日视为有效送达；通知如果是通过电子邮件发出的，则应自电子邮件进入您提供的电子邮箱的时间或您提供的电子邮箱地址失效时平台授权电子邮箱收到传送失败的系统提示时即视为有效送达；通知如果是以除电子邮件以外的其他电子形式发出的，包括但不限于在本平台公告、公示，向您的账号发送弹窗信息、系统消息，向您提供的联系电话发送手机短信等，在本平台使用的发送设备上显示发送成功后即视为送达。
            </p>
            <div class="text-h4 q-mb-md">十二、法律适用争议解决</div>
            <p>
              本协议之订立、生效、解释、修订、补充、终止、执行与争议解决均适用新加坡大陆地区法律法规。如法律法规无相关规定的，参照商业惯例及/或行业惯例。
            </p>
            <p>
              您因使用本平台服务所产生及与本平台服务有关的争议，由本平台与您协商解决。协商不成时，任何一方均可向本平台所在地有管辖权的人民法院提起诉讼。
            </p>
            <p>
              如您在使用本平台第三方合作机构提供的某项具体服务过程中与服务提供方产生争议、或您通过本平台与其他第三方进行交易或其他行为产生争议，您应与服务提供方、第三方根据签署的相关协议或相关法律规定确定各自的权利义务，自主协商或以仲裁、诉讼方式妥善解决双方之间的争议。
            </p>
            <p>
              如您要求，本平台可以从中调解，协助您与服务提供方、第三方沟通。本平台将应您的要求协助您维护您在交易中的合法权益，但本平台不代表或担保您的权益，不保证处理结果符合您的期望，亦不对您与第三方之间争议的后果负责。
            </p>
            <div class="text-h4 q-mb-md">十三、协议终止及其他</div>
            <p>出现以下情形时，本协议终止:</p>
            <p>
              (1) 您通过平台提示的注销方式注销您的账户，本协议自注销完成时终止；
            </p>
            <p>(2) 您违反本协议约定，我们根据违约责任条款终止本协议；</p>
            <p>
              (3)
              您在使用本平台过程中，存在违反法律法规规定的行为，本平台依法对您的账户予以查封、注销的，本协议自注销完成时终止；
            </p>
            <p>(4) 其他应当终止服务的情形。</p>
            <p>
              本协议终止后，除非法律有明确规定外，我们无义务向您或您指定的第三方披露您账户中的任何信息。
            </p>
            <p>
              本协议终止后，本平台仍有权利依据本协议追究您过往违约行为的违约责任。
            </p>
            <p>
              本协议各方确认，本协议的签署、生效和履行以不违反法律法规为前提，如果本协议中的任何一条或多条违反适用的法律法规，则该条将被视为无效，但无效条款不影响本协议其他条款的效力。
            </p>
          </q-tab-panel>
          <q-tab-panel class="inside-cont-term-privacy" name="privacyPolicy">
            <div class="text-h4 q-mb-md">
              用户隐私政策
              <span v-show="$q.screen.width > 700" class="text-h6">
                更新日期：【2022】年【08】月【03】日
              </span>
            </div>
            <span v-show="$q.screen.width <= 700" class="text-h6">
              更新日期：【2022】年【08】月【03】日
            </span>
            <p>
              欢迎使用货币汇率，本产品（包括但不限于网址为【少网址】的网站、名称为“货币汇率”的移动客户端APP以及公司后续不时开发或运营的其他平台）由Matrix
              Networking
              PTE.LTD.（以下简称“我们”）设计与开发，并享有全部知识产权。我们深知个人信息对您的重要性，并会尽全力保护您的个人信息安全可靠。我们致力于维持您对我们的信任，恪守以下原则，保护您的个人信息：权责一致原则、目的明确原则、选择同意原则、最少够用原则、确保安全原则、主体参与原则、公开透明原则等。同时，我们承诺，我们将按业界成熟的安全标准，采取相应的安全保护措施来保护您的个人信息。请在使用我们的产品（或服务）
              前，仔细阅读并了解本《隐私权政策》。
            </p>
            <div class="text-h4 q-mb-md">
              一、我们如何收集和使用您的个人信息
            </div>
            <p>
              个人信息是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。我们仅会出于本政策所述的以下目的，收集和使用您的个人信息
            </p>
            <p class="text-h5 q-mb-md">（一）为您提供汇率和汇款信息服务。</p>
            <p>1、为您提供汇率信息服务</p>
            <p>
              我们为用户提供汇率信息服务。如果您使用的是最基础的汇率查询功能，那么您无需注册账户，但需要授权我们读取您的地理位置（当地货币功能必须要用到地理位置）、手机内的文件（用户反馈页面的上传图片功能需要获取这个权限）。
            </p>
            <p>
              如果您希望获得某些高级功能的使用权限，那么您需要创建账号。为完成创建账号，您可能需要提供以下信息：您的姓名、手机号、电子邮箱地址、创建的用户名和密码。
            </p>
            <p>
              您提供的上述信息，将在您使用本服务期间持续授权我们使用。在您注销账号时，我们将停止使用并删除上述信息。
            </p>
            <p>
              上述信息将存储于新加坡境内。如需跨境传输，我们将会单独征得您的授权同意。
            </p>
            <p class="text-h5 q-mb-md">
              （二）开展内部数据分析和研究，第三方SDK统计服务，改善我们的产品或服务。
            </p>
            <p>
              我们收集数据是根据您与我们的互动和您所做出的选择，包括您的隐私设置以及您使用的产品和功能。我们收集的数据可能包括IP地址、平台、时间戳、独立设备标识符、iOS广告标识符（IDFA)、安卓广告主标识符、网卡（MAC）地址、国际移动设备识别码（IMEI）、设备型号、终端设备操作系统版本、语言所在地、时区和网络状态等。
            </p>
            <p>
              当我们要将信息用于本策略未载明的其它用途时，会事先征求您的同意。
            </p>
            <p>
              当我们要将基于特定目的收集而来的信息用于其他目的时，会事先征求您的同意。
            </p>
            <div class="text-h4 q-mb-md">
              二、我们如何使用 Cookie 和同类技术
            </div>
            <p class="text-h5 q-mb-md">（一）Cookie</p>
            <p>
              为确保App和Web服务正常运转，我们会在您的智能设备上存储名为 Cookie
              的小数据文件。Cookie
              通常包含标识符、站点名称以及一些号码和字符。借助于
              Cookie，App能够存储您选择的货币种类或其他设置。
            </p>
            <p>
              我们不会将 Cookie
              用于本政策所述目的之外的任何用途。您可根据自己的偏好管理或删除
              Cookie。您可以清除本地上缓存的所有
              Cookie，当然这也可能导致清除后您对本软件做的设置被清空，可能给您造成不便。
            </p>
            <p class="text-h5 q-mb-md">（二）网站信标和像素标签</p>
            <p>
              除 Cookie
              外，我们还会在网站上使用网站信标和像素标签等其他同类技术。例如，我们向您发送的电子邮件可能含有链接至我们网站内容的点击
              URL。如果您点击该链接，我们则会跟踪此次点击，帮助我们了解您的产品或服务偏好并改善客户服务。网站信标通常是一种嵌入到网站或电子邮件中的透明图像。借助于电子邮件中的像素标签，我们能够获知电子邮件是否被打开。如果您不希望自己的活动以这种方式被追踪，则可以随时从我们的寄信名单中退订。
            </p>
            <p class="text-h5 q-mb-md">（三）Do Not Track（请勿追踪）</p>
            <p>
              很多网络浏览器均设有 Do Not Track 功能，该功能可向网站发布 Do Not
              Track
              请求。目前，主要互联网标准组织尚未设立相关政策来规定网站应如何应对此类请求。但如果您的浏览器启用了
              Do Not Track，那么我们的所有网站都会尊重您的选择。
            </p>
            <div class="text-h4 q-mb-md">
              三、我们如何共享、转让、公开披露您的个人信息
            </div>
            <p class="text-h5 q-mb-md">（一）共享</p>
            <p>
              我们不会向其他任何公司、组织和个人分享您的个人信息，但以下情况除外：
            </p>
            <p>
              1、在获取明确同意的情况下共享：获得您的明确同意后，我们会与其他方共享您的个人信息。
            </p>
            <p>
              2、我们可能会根据法律法规规定，或按政府主管部门的强制性要求，对外共享您的个人信息。
            </p>
            <p>
              3、与授权合作伙伴共享：仅为实现本隐私权政策中声明的目的，我们的某些服务将由授权合作伙伴提供。我们可能会与合作伙伴共享您的某些个人信息，以提供更好的客户服务和用户体验。这些授权合作伙伴可能包括：软件服务提供商、智能设备提供商、系统服务提供商、供应商、服务提供商以及分析服务类合作伙伴。
            </p>
            <p>
              未经您的授权，我们不会将您的个人信息分享给广告、金融和征信服务类商家。
            </p>
            <p>
              对我们与之共享个人信息的公司、组织和个人，我们会与其签署严格的保密协定，要求他们按照我们的说明、本隐私政策以及其他任何相关的保密和安全措施来处理个人信息。如果转让信息的范围超出协议约定，我们将另外征得您的授权。
            </p>
            <p class="text-h5 q-mb-md">（二）转让</p>
            <p>
              我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：
            </p>
            <p>
              1、在获取明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的个人信息；
            </p>
            <p>
              2、在涉及合并、收购或破产清算时，如涉及到个人信息转让，我们会在要求新的持有您个人信息的公司、组织继续受此隐私政策的约束，否则我们将要求该公司、组织重新向您征求授权同意。
            </p>
            <p class="text-h5 q-mb-md">（三）公开披露</p>
            <p>我们仅会在以下情况下，公开披露您的个人信息：</p>
            <p>1、获得您明确同意后;</p>
            <p>
              2、基于法律的披露：在法律、法律程序、诉讼或政府主管部门强制性要求的情况下，我们可能会公开披露您的个人信息。
            </p>
            <div class="text-h4 q-mb-md">四、我们如何保护您的个人信息</div>
            <p>
              （一）我们已使用符合业界标准的安全防护措施保护您提供的个人信息，防止数据遭到未经授权访问、公开披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施，保护您的个人信息。例如，在您的浏览器与“服务”之间交换数据（如支付信息）时受
              SSL 加密保护；我们同时对我们网站提供 https
              安全浏览方式；我们会使用加密技术确保数据的保密性；我们会使用受信赖的保护机制防止数据遭到恶意攻击；我们会部署访问控制机制，确保只有授权人员才可访问个人信息；以及我们会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。
            </p>
            <p>
              （二）我们会采取一切合理可行的措施，确保未收集无关的个人信息。我们只会在达成本政策所述目的所需的期限内保留您的个人信息，除非需要延长保留期或受到法律的允许。
            </p>
            <p>
              （三）互联网并非绝对安全的环境，而且电子邮件、即时通讯、及与其他我们用户的交流方式并未加密，我们强烈建议您不要通过此类方式发送个人信息。请使用复杂密码，协助我们保证您的账号安全。
            </p>
            <p>
              （四）互联网环境并非百分之百安全，我们将尽力确保或担保您发送给我们的任何信息的安全性。如果我们的物理、技术、或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改、或毁坏，导致您的合法权益受损，我们将承担相应的法律责任。
            </p>
            <p>
              （五）在不幸发生个人信息安全事件后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。
            </p>
            <p>
              同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。
            </p>
            <div class="text-h4 q-mb-md">五、您的权利</div>
            <p>
              按照中国相关的法律、法规、标准，以及其他国家、地区的通行做法，我们保障您对自己的个人信息行使以下权利：
            </p>
            <p class="text-h5 q-mb-md">（一）访问您的个人信息</p>
            <p>
              您有权访问您的个人信息，法律法规规定的例外情况除外。如果您想行使数据访问权，可以通过以下方式自行访问：
            </p>
            <p>
              账户信息——如果您希望访问或编辑您的账户中的个人资料信息和支付信息、更改您的密码、添加安全信息等，您可以在“设置-个人中心”执行此类操作。
            </p>
            <p>
              搜索信息——您可以在“切换货币”页面看到您最近的货币搜索历史记录、如果不想保留搜索记录，可以通过“设置-恢复默认币种列表”清除全部的货币搜索历史记录。
            </p>
            <p>
              如果您无法通过上述方法访问这些个人信息，您可以随时发送电子邮件至<a
                href="mailto:matrixnetworking2022@gmail.com">
                matrixnetworking2022@gmail.com </a
              >。我们将在30天内回复您的访问请求。对于您在使用我们的产品或服务过程中产生的其他个人信息，只要我们不需要过多投入，我们会向您提供。如果您想行使数据访问权，请发送电子邮件至
              <a href="mailto:matrixnetworking2022@gmail.com">
                matrixnetworking2022@gmail.com </a
              >。
            </p>
            <p class="text-h5 q-mb-md">（二）更正您的个人信息</p>
            <p>
              当您发现我们处理的关于您的个人信息有错误时，您有权要求我们做出更正。您可以通过访问“设置-个人中心”的方式提出更正申请。如果您无法通过上述链接更正这些个人信息，您可以随时发送电子邮件至
              <a href="mailto:matrixnetworking2022@gmail.com">
                matrixnetworking2022@gmail.com
              </a>
              。我们将在30天内回复您的更正请求。
            </p>
            <p class="text-h5 q-mb-md">（三）删除您的个人信息</p>
            <p>如果出现以下情形，你可以删除您的个人信息：</p>
            <p>1、如果我们处理个人信息的行为违反法律法规；</p>
            <p>2、如果我们收集、使用您的个人信息，却未征得您的同意；</p>
            <p>3、如果我们处理个人信息的行为违反了与您的约定；</p>
            <p>4、如果您不再使用我们的产品或服务，或您注销了账号；</p>
            <p>5、如果我们不再为您提供产品或服务。</p>
            <p>
              如果您想删除您的个人信息，你可以通过访问“设置-个人中心”删除您的个人信息。在响应您的删除请求的同时，我们还将通知从我们获得您的个人信息的接收方，要求其及时删除。另外，在提出删除账号的请求时，您需向我们证明您是这个账号的所有者。当您从我们的服务中删除信息后，我们可能不会立即备份系统中删除相应的信息，但会在备份更新时删除这些信息。
            </p>
            <p class="text-h5 q-mb-md">（四）改变您授权同意的范围</p>
            <p>
              每个业务功能需要一些基本的个人信息才能得以完成（见本策略“第一部分”）。对于额外收集的个人信息的收集和使用，您可以随时给予或收回您的授权同意。您可以通过访问手机权限管理中心来修改授权范围。当您收回授权后，一些需要基于您授权的信息而运行的功能的正常性可能受到影响，但不会影响此前基于您的授权而开展的个人信息处理。如果您不想接受我们给您发送的商业广告，您可以发送电子邮件至<a
                href="mailto:matrixnetworking2022@gmail.com">
                matrixnetworking2022@gmail.com </a
              >。我们将在30天内回复您的删除请求。
            </p>
            <p class="text-h5 q-mb-md">（五）个人信息主体注销账户</p>
            <p>
              每个业务功能需要一些基本的个人信息才能得以完成（见本策略“第一部分”）。对于额外收集的个人信息的收集和使用，您可以随时给予或收回您的授权同意。您可以通过访问手机权限管理中心来修改授权范围。当您收回授权后，一些需要基于您授权的信息而运行的功能的正常性可能受到影响，但不会影响此前基于您的授权而开展的个人信息处理。如果您不想接受我们给您发送的商业广告，您可以发送电子邮件至<a
                href="mailto:matrixnetworking2022@gmail.com">
                matrixnetworking2022@gmail.com </a
              >操作。在注销账户之后，我们将停止为您提供产品或服务，并依据您的要求，删除您的个人信息，法律法规另有规定的除外。
            </p>
            <p class="text-h5 q-mb-md">（六）个人信息主体获取个人信息副本</p>
            <p>
              您有权获取您的个人信息副本，您可以通过发送电子邮件至<a
                href="mailto:matrixnetworking2022@gmail.com">
                matrixnetworking2022@gmail.com </a
              >操作提交申请。在技术可行的前提下，例如数据接口匹配，我们还可按您的要求，直接将您的个人信息副本传输给您指定的第三方。
            </p>
            <p class="text-h5 q-mb-md">（七）约束信息系统自动决策</p>
            <p>
              在某些业务功能中，我们可能仅依据信息系统、算法等在内的非人工自动决策机制做出决定。如果这些决定显著影响您的合法权益，您有权要求我们做出解释，我们也将提供适当的救济方式。
            </p>
            <p class="text-h5 q-mb-md">（八）响应您的上述请求</p>
            <p>
              为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。
            </p>
            <p>我们将在三十天内做出答复。</p>
            <p>
              对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情收取一定成本费用。对于那些无端重复、需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际（例如，涉及备份磁带上存放的信息）的请求，我们可能会予以拒绝。
            </p>
            <p>我们将在三十天内做出答复。</p>
            <p>1、与国家安全、国防安全有关的；</p>
            <p>2、与公共安全、公共卫生、重大公共利益有关的；</p>
            <p>3、与犯罪侦查、起诉和审判等有关的；</p>
            <p>4、有充分证据表明您存在主观恶意或滥用权利的；</p>
            <p>
              5、响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的。
            </p>
            <div class="text-h4 q-mb-md">六、我们如何处理儿童的个人信息</div>
            <p>
              我们的产品、网站和服务主要面向成人。如果没有父母或监护人的同意，儿童不得创建自己的用户账户。对于经父母同意而收集儿童个人信息的情况，
              我们只会在受到法律允许、
              父母或监护人明确同意或者保护儿童所必要的情况下使用或公开披露此信息。尽管当地法律和习俗对儿童的定义不同，
              但我们将不满 14
              周岁的任何人均视为儿童。如果我们发现自己在未事先获得可证实的父母同意的情况下收集了儿童的个人信息，
              则会设法尽快删除相关数据。
            </p>
            <div class="text-h4 q-mb-md">
              七、您的个人信息如何在全球范围转移
            </div>
            <p>
              原则上，我们在新加坡境内收集和产生的个人信息，将存储在新加坡境内。由于我们通过遍布全球的资源和服务器提供产品或服务，这意味着，我们可能会出于的目的，将您的某些个人信息转移到您使用产品或服务所在国家/地区的境外管辖区，或者使您的个人信息受到来自这些管辖区的访问。此类管辖区可能设有不同的数据保护法，甚至未设立相关法律。在此类情况下，我们会我们会按照国家网信部门会同国务院制定的办法和相关标准对数据的安全保障措施进行评估，并符合其要求。例如，我们会请求您对跨境转移个人信息的同意，或者在跨境数据转移之前实施数据去标识化等安全举措。如果跨境移转的数据超出您授权的范围，我们会单独征得您的授权。
            </p>
            <div class="text-h4 q-mb-md">八、本隐私权政策如何更新</div>
            <p>
              我们可能适时会对本隐私权政策进行调整或变更，本隐私权政策的任何更新将以标注更新时间的方式公布在我们网站上，除法律法规或监管规定另有强制性规定外，经调整或变更的内容一经通知或公布后的7日后生效。如您在隐私权政策调整或变更后继续使用我们提供的任一服务或访问我们相关网站的，我们相信这代表您已充分阅读、理解并接受修改后的隐私权政策并受其约束。
            </p>
            <div class="text-h4 q-mb-md">九、如何联系我们</div>
            <p>
              如果您对本隐私政策有任何疑问、意见或建议，通过以下方式与我们联系：
            </p>
            <p>
              邮箱：<a href="mailto:matrixnetworking2022@gmail.com">
                matrixnetworking2022@gmail.com </a
              >； 电话：【 +65 8690 6134 】
            </p>
          </q-tab-panel>
        </q-tab-panels>
      </template>
    </q-splitter>
  </q-page>
</template>

<script>
import { defineComponent, ref } from 'vue'

export default defineComponent({
  name: 'IndexPage',
  setup() {
    document.title = 'Term&Condition-Currency'

    const tab = ref('userAgreement')
    const splitterModel = ref(20)

    return { tab, splitterModel }
  }
})
</script>

<style>
.inside-cont-term-privacy {
  padding: 10vh 10vw;
}

.tabColor {
  color: #e8aa10;
}

.block {
  font-size: 21px;
}

@media screen and (max-width: 910px) {
  .block {
    font-size: 17px;
  }
}
</style>
